{"class_name": "Model", "keras_version": "2.1.5", "config": {"layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "name": "input_1"}, "inbound_nodes": []}, {"name": "block1_conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "block1_conv1", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "block1_conv2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 64, "name": "block1_conv2", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"name": "block1_pool", "class_name": "MaxPooling2D", "config": {"name": "block1_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"name": "block2_conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 128, "name": "block2_conv1", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"name": "block2_conv2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 128, "name": "block2_conv2", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"name": "block2_pool", "class_name": "MaxPooling2D", "config": {"name": "block2_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"name": "block3_conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "name": "block3_conv1", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"name": "block3_conv2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "name": "block3_conv2", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_conv1", 0, 0, {}]]]}, {"name": "block3_conv3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 256, "name": "block3_conv3", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_conv2", 0, 0, {}]]]}, {"name": "block3_pool", "class_name": "MaxPooling2D", "config": {"name": "block3_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["block3_conv3", 0, 0, {}]]]}, {"name": "block4_conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "name": "block4_conv1", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block3_pool", 0, 0, {}]]]}, {"name": "block4_conv2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "name": "block4_conv2", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"name": "block4_conv3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "name": "block4_conv3", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"name": "block4_pool", "class_name": "MaxPooling2D", "config": {"name": "block4_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["block4_conv3", 0, 0, {}]]]}, {"name": "block5_conv1", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "name": "block5_conv1", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"name": "block5_conv2", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "name": "block5_conv2", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_conv1", 0, 0, {}]]]}, {"name": "block5_conv3", "class_name": "Conv2D", "config": {"kernel_constraint": null, "padding": "same", "use_bias": true, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_size": [3, 3], "filters": 512, "name": "block5_conv3", "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["block5_conv2", 0, 0, {}]]]}, {"name": "block5_pool", "class_name": "MaxPooling2D", "config": {"name": "block5_pool", "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2], "trainable": true, "strides": [2, 2]}, "inbound_nodes": [[["block5_conv3", 0, 0, {}]]]}, {"name": "flatten", "class_name": "Flatten", "config": {"name": "flatten", "trainable": true}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"name": "fc1", "class_name": "Dense", "config": {"kernel_constraint": null, "trainable": true, "use_bias": true, "bias_regularizer": null, "name": "fc1", "units": 4096, "activation": "relu", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}, "inbound_nodes": [[["flatten", 0, 0, {}]]]}], "output_layers": [["fc1", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow"}